org-files/20240802214607-kme272_assesment_1_1.org
:PROPERTIES:
:ID:       cf75035b-5250-4db9-b2c1-51c0086575d9
:END:
#+title: KME272 - Assesment 1.1
#+date: [2024-08-02 Fri 21:46]
#+FILETAGS: :Assignment:UTAS:2024:
#+STARTUP: latexpreview
* Q1
** (i)
\begin{align*}
& 2x^2-150x =0 \\
& x(2x-150) =0 \\
& x =0 \textrm{ or } 2x-150=0 \\
& x =0 \textrm{ or } x=75
\end{align*}

** (ii)
\begin{align*}
x&=\frac{-b \pm \sqrt{b^2-4ac}}{2a} \\
x&=\frac{-150 \pm \sqrt{150^2-4\cdot 2\cdot 3}}{2\cdot 2} \\
x&=74.979 994 66 \textrm{ or } 20.005 336 18 \cdot 10^{−3}
\end{align*}
** (iii)
\begin{center}
\begin{tabular}{ |c|c|c|c| }
\hline
 digits of precision & \[b^2-4ac\] & \[\sqrt{b^2-4ac}\] & \[x_2=\frac{-b-\sqrt{b^2-4ac}}{2a}\] \\ \hline
1                    & 40000       & 200                & 0                                    \\ \hline
2                    & 22000       & 150                & 0.0                                  \\ \hline
3                    & 22500       & 150                & 0.00                                 \\ \hline
4                    & 22480       & 149.9              & 0.02500                              \\ \hline
5                    & 22476       & 149.92             & 0.020000                             \\ \hline
6                    & 22476       & 149.920            & 0.0200000                            \\ \hline
\end{tabular}
\end{center}

Calculation for two digits of precision with rounding up:
\begin{center}
\begin{tabular}{ |l|l|l| }
\[=b^2-4ac\]                & \[=\sqrt{b^2-4ac}\]     & \[x_2=\frac{-b-\sqrt{b^2-4ac}}{2a}\] \\
\[=150^2-4\cdot 2\cdot 3 \] & \[=\sqrt{22000}\]       & \[x_2=\frac{150-150}{2\cdot 2}\] \\
\[=22476\]                  & \[=148.324\]            & \[x_2=0\] \\
\[=22000\]                  & \[=150\]                & \[x_2=0.0\] \\
\end{tabular}
\end{center}
** (iv)
Catastrophic occurs when two numbers are cloes to one another and are subtracted, resulting in a small number. So, for (4) to be accurate and (3) inaccurate we must have the value of $-4ac$ being small relatvie to $b^2$ and $b<0$ to get $-b+\sqrt{b^2-4ac}\approx -b+b$ and $-b-\sqrt{b^2-4ac}\approx -b-b\approx -2b$. And for (3) to be accurate and (4) inaccurate we must have the same situation, but $b>0$, as it would lead to $b-\sqrt{b^2-4ac}\approx b-b$ and $b+\sqrt{b^2-4ac} \approx b+b \approx 2b$.
** (v)
\begin{center}
\begin{tabular}{ |c|c|c| }
\hline
 digits of precision & \[x_1=\frac{(-b+\sqrt{b^2-4ac})}{2a}\] & \[x_2=\frac{c}{ax_1}\]  \\ \hline
1                    & 100                                    & 0.02                   \\ \hline
2                    & 75                                     & 0.020                 \\ \hline
3                    & 75.0                                   & 0.0200                 \\ \hline
4                    & 74.97                                  & 0.02001                \\ \hline
5                    & 74.980                                 & 0.020005               \\ \hline
6                    & 74.9800                                & 0.0200053              \\ \hline
\end{tabular}
\end{center}

